load-tests/artillery.yml
config:
  target: "http://127.0.0.1:17001"
  phases:
    - duration: 300
      arrivalRate: 300

scenarios:
  - name: "POST /v1/events/produce"
    flow:
      - post:
          url: "/v1/events/produce"
          headers:
            Content-Type: "application/json"
          json:
            payload: "{\"client_time\":\"2000-01-01 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000001\",\"device_os\":\"iOS\",\"session\":\"s1\",\"sequence\":1,\"event\":\"example_1\",\"param_int\":123,\"param_str\":\"string1\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}\n{\"client_time\":\"2000-01-02 00:00:00\",\"device_id\":\"00000000-0000-0000-0000-000000000002\",\"device_os\":\"Android\",\"session\":\"s2\",\"sequence\":2,\"event\":\"example_2\",\"param_int\":1234,\"param_str\":\"string2\"}"