load-tests/report.txt
--------------------------------
Summary report @ 12:18:05(+0200)
--------------------------------

http.codes.200: ................................................................ 90000
http.request_rate: ............................................................. 300/sec
http.requests: ................................................................. 90000
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 217
  median: ...................................................................... 1
  p95: ......................................................................... 3
  p99: ......................................................................... 7
http.responses: ................................................................ 90000
vusers.completed: .............................................................. 90000
vusers.created: ................................................................ 90000
vusers.created_by_name.POST /v1/events/produce: ................................ 90000
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.1
  max: ......................................................................... 263.5
  median: ...................................................................... 1.7
  p95: ......................................................................... 4.9
  p99: ......................................................................... 41.7

------------------------------------------------------------------------------------------------

SELECT count(*)
FROM events.logs

Query id: fa6a2298-0e4b-40a2-8e8b-7fc83eff09cc

┌───count()───┐
│   4444571   │
└─────────────┘